Repository: LXOXO-netizen/quiz
Catalog: po/*.po
Languages: es, tr

source: Language
es: Idioma
tr: Dil

source: lang_name_en
es: Inglés
tr: İngilizce

source: lang_name_cs
es: Checo
tr: Çekçe

source: lang_name_tr
es: Turco

source: lang_name_de
es: Alemán

source: lang_name_ca
es: Catalán

source: lang_name_ja
es: Japonés

source: Stats
es: Estadísticas
tr: İstatistikler

source: Start
es: Comenzar
tr: Başla

source: Back
es: Atrás
tr: Geri

source: Next
es: Siguiente
tr: Sonraki

source: Time left
es: Tiempo restante
tr: Zaman kaldı

source: Back to Main Page
es: Regresar a la página principal
tr: Ana sayfaya geri dön

source: Nickname
es: Apodo
tr: Takma Ad

source: Score
es: Puntuación
tr: Skor

source: Correct
es: Correcto
tr: Doğru

source: Wrong
es: Incorrecto
tr: Yanlış

source: Submit
es: Enviar
tr: Gönder

source: Submit and Quit
es: Enviar y salir
tr: Gönder ve Çık

source: Quit
es: Salir
tr: Çıkış

source: Are you sure you want to quit and submit?
es: ¿Estás seguro de que quieres salir y enviar?
tr: Çıkıp cevapları göndermek istediğinizden emin misiniz?

source: Are you sure you want to quit? Your progress will not be saved.
es: ¿Estás seguro de que quieres dejar salir? Tu progreso no se guardará.
tr: Çıkmak istediğinizden emin misiniz? İlerlemeniz kaydedilmeyecek.

source: openSUSE Quizzes
es: Cuestionarios de openSUSE
tr: openSUSE Soruları

source: Available quizzes
es: Cuestionarios disponibles
tr: Mevcut Sınavlar

source: openSUSE Expert
es: Experto de openSUSE
tr: openSUSE Uzman

source: Challenge other users in our leaderboard. 30 seconds per question. Stop anytime.
es: Desafía a otros usuarios en nuestra tabla de clasificación. 30 segundos por pregunta. Detente en cualquier momento.

source: What is the mascot of openSUSE project?
es: ¿Cuál es la mascota del proyecto openSUSE?
tr: OpenSUSE projesinin maskotu nedir?

source: What is the main goal of the openSUSE project?
es: ¿Cuál es el objetivo principal del proyecto openSUSE?
tr: OpenSUSE projesinin temel amacı nedir?

source: Supporting and spreading open-source software
es: Apoyar y difundir el software de código abierto
tr: Açık kaynaklı yazılımların desteklenmesi ve yaygınlaştırılması

source: Developing mobile applications
es: Desarrollo de aplicaciones móviles
tr: Mobil uygulama geliştirme

source: Producing video games
es: Producción de videojuegos
tr: Video oyunları üretmek

source: Research in artificial intelligence
es: Investigación en inteligencia artificial
tr: Yapay zeka alanında araştırmak yapmak

source: What are Aeon and Kalpa?
es: ¿Qué son Aeon y Kalpa?
tr: Aeon ve Kalpa nedir?

source: Modern 'Immutable' desktops with GNOME and KDE
es: Escritorios modernos 'Inmutables' con GNOME y KDE
tr: GNOME ve KDE ile modern 'Değiştirilemez' masaüstleri

source: Rolling distributions with transactional updates using flatpaks on the desktop
es: Distribuciones de actualización contínua con actualizaciones transaccionales mediante flatpaks en el escritorio
tr: Masaüstünde flatpak kullanarak "işlemsel güncelleme" yapabilen sürekli güncellenen dağıtımlardır

source: Distributions built on top of MicroOS
es: Distribuciones desarrolladas sobre MicroOS
tr: MicroOS üzerine inşa edilen dağıtımlar

source: All options are correct
es: Todas las opciones son correctas
tr: Tüm seçenekler doğrudur

source: Where was the openSUSE project founded?
es: ¿Dónde se fundó el proyecto openSUSE?
tr: OpenSUSE projesi nerede kuruldu?

source: In Choustníkovo Hradiště
es: En Choustníkovo Hradiště
tr: Choustníkovo Hradiště'de

source: At LinuxWorld Conference & Expo 2005 in San Francisco
es: En la LinuxWorld Conference & Expo 2005 en San Francisco
tr: 2005 yılındaki San Francisco'daki LinuxWorld Konferansı ve Fuarı

source: In Redmont
es: En Redmont
tr: Redmont

source: At the University of Helsinki
es: En la Universidad de Helsinki

source: What is the default filesystem in openSUSE?
es: ¿Cuál es el sistema de archivos predeterminado en openSUSE?
tr: OpenSUSE'deki varsayılan dosya sistemi nedir?

source: What’s the name of the new installer in Leap 16?
es: ¿Cómo se llama el nuevo instalador de Leap 16?
tr: Leap 16'daki yeni yükleyicinin adı nedir?

source: Which openSUSE distribution is optimized for running containers and micro services?
es: ¿Qué distribución de openSUSE está optimizada para ejecutar contenedores y microservicios?
tr: Hangi openSUSE dağıtımı konteyner ve mikro servisleri çalıştırmak için optimize edilmiştir?

source: MicroOS and Leap Micro
es: MicroOS y Leap Micro
tr: MicroOS ve Leap Micro

source: Which openSUSE rolling distribution offers a calmer alternative to Tumbleweed for users who prefer fewer surprises?
es: ¿Qué distribución de actualización contínua de openSUSE ofrece una alternativa más tranquila a Tumbleweed para los usuarios que prefieren menos sorpresas?

source: Which of the following package managers is commonly used in openSUSE?
es: ¿Cuál de los siguientes gestores de paquetes se utiliza habitualmente en openSUSE?
tr: Aşağıdakilerden hangisi openSUSE'de yaygın olarak kullanılan paket yöneticisidir?

source: What is Leap 16.0?
es: ¿Qué es Leap 16.0?
tr: Leap 16.0 nedir ?

source: A traditional Linux distribution, the successor to Leap 15.6, released in Fall 2025
es: Una distribución tradicional de Linux, sucesora de Leap 15.6, lanzada en otoño de 2025
tr: Leap 15.6'nın halefi olan ve 2025 Sonbaharında piyasaya sürülen geleneksel bir Linux dağıtımı

source: An immutable distribution with GNOME and KDE
es: Una distribución inmutable con GNOME y KDE
tr: GNOME ve KDE ile değiştirilemez bir dağıtım

source: A rolling release for mobile devices
es: Una versión continua para dispositivos móviles
tr: Mobil cihazlar için sürekli güncellenen bir sürüm

source: A container-focused system like MicroOS
es: Un sistema centrado en contenedores como MicroOS
tr: MicroOS gibi konteyner odaklı bir sistem

source: Which desktop environment is the default for openSUSE Leap 15?
es: ¿Qué entorno de escritorio es el predeterminado para openSUSE Leap 15?

source: There is no default. We leave choice to the user.
es: No hay ningún valor predeterminado. Dejamos la elección al usuario.

source: What is the name of the openSUSE build system?
es: ¿Cómo se llama el sistema de compilación de openSUSE?

source: How can you make changes to a root partition on a transactional-update based system?
es: ¿Cómo se pueden realizar cambios en una partición raíz en un sistema basado en actualizaciones transaccionales?

source: Use transactional-update command and reboot into a new snapshot
es: Utilice el comando transactional-update y reinicie en una nueva instantánea

source: By using sudo-sudo to gain giga privileges
es: Mediante el uso de sudo-sudo para obtener todos los privilegios

source: By using Salt or Ansible
es: Mediante el uso de Salt o Ansible

source: You have to edit files under a user netrunner and cross fingers
es: Tienes que editar archivos bajo un netrunner de usuario y cruzar los dedos

source: What is 'YaST'?
es: ¿Qué es 'YaST'?

source: A chameleon species native to Africa
es: Una especie de camaleón originaria de África

source: A free software for configuration of operating system
es: Un software libre para la configuración del sistema operativo

source: The default web browser
es: El navegador web predeterminado

source: A programming language
es: Un lenguaje de programación

source: What is the primary goal of the openSUSE Aeon distribution?
es: ¿Cuál es el objetivo principal de la distribución openSUSE Aeon?

source: A modern transactional-desktop system with GNOME
es: Un moderno sistema de escritorio transaccional con GNOME

source: Scientific research
es: Investigación científica

source: Containerization
es: Contenerización

source: Enterprise use
es: Uso empresarial

source: What is the go-to place to learn about projects from Rancher and SUSE?
es: ¿Cuál es el lugar al que acudir para obtener información sobre los proyectos de Rancher y SUSE?

source: Chameleons are primarily found in which part of the world?
es: ¿En qué parte del mundo se encuentran principalmente los camaleones?

source: South America
es: Sudamérica

source: Africa and Madagascar
es: África y Madagascar

source: Southeast Asia
es: Sudeste Asiático

source: Antarctica
es: Antártida

source: Where can you check the current status of openSUSE infrastructure?
es: ¿Dónde se puede comprobar el estado actual de la infraestructura de openSUSE?

source: Where can you install additional packages or packages with changes that didn't make it into the main distribution?
es: ¿Dónde se pueden instalar paquetes adicionales o paquetes con cambios que no llegaron a la distribución principal?

source: With a single click from software.opensuse.org
es: Con un solo clic desde software.opensuse.org

source: By browsing the myriad of projects on OBS build.opensuse.org
es: Al navegar por la gran cantidad de proyectos en OBS build.opensuse.org

source: Through command opi, from the Packman repository or from Flathub
es: A través del comando opi, desde el repositorio de Packman o desde Flathub

source: When submitting packages to openSUSE, where do you send them (metaphorically)?
es: Al enviar paquetes a openSUSE, ¿a dónde los envías (metafóricamente)?

source: build.opensuse.org, not a carrier pigeon
es: build.opensuse.org, no una paloma mensajera

source: To the cloud (literally)
es: A la nube (literalmente)

source: By email to the Geeko mascot
es: Por correo electrónico a la mascota Geeko

source: Via smoke signals from Nuremberg
es: A través de señales de humo desde Núremberg

source: What is the name of the new package manager GUI replacing YaST?
es: ¿Cómo se llama la nueva interfaz gráfica de usuario del gestor de paquetes que sustituye a YaST?

source: How often does openSUSE Leap release a new stable version?
es: ¿Con qué frecuencia openSUSE Leap lanza una nueva versión estable?

source: Every 5 years when the stars align
es: Cada 5 años cuando los astros se alinean

source: Monthly, to keep everyone on their toes
es: Mensualmente, para mantener a todos alerta

source: Annually
es: Anualmente

source: Every time a tumbleweed rolls by
es: Cada vez que pasa una planta rodadora del desierto

source: Which openSUSE mailing list is focused on development discussions?
es: ¿Qué lista de correo de openSUSE se centra en las discusiones sobre desarrollo?

source: openSUSE's build service allows you to build packages for how many different distributions?
es: ¿El servicio de compilación de openSUSE te permite crear paquetes para cuántas distribuciones diferentes?

source: Just openSUSE Leap
es: Unicamente para openSUSE Leap

source: Over 100, including Fedora and Debian
es: Más de 100, incluyendo Fedora y Debian

source: Only Tumbleweed
es: Solo Tumbleweed

source: None, it only builds source code
es: Ninguna, solo compila código fuente

source: openSUSE Leap is based on which upstream distribution?
es: ¿En qué distribución principal se basa openSUSE Leap?

source: Which tool does openSUSE use for system snapshots and rollback?
es: ¿Qué herramienta utiliza openSUSE para las instantáneas del sistema y la reversión?

source: What command can you use to refresh zypper repositories?
es: ¿Qué comando se puede usar para actualizar los repositorios con zypper?

source: Where can you submit bug reports related to openSUSE packages?
es: ¿Dónde se pueden enviar informes de errores relacionados con los paquetes de openSUSE?

source: Which openSUSE service mirrors openSUSE software repositories worldwide?
es: ¿Qué servicio de openSUSE ofrece réplicas de los repositorios de software de openSUSE en todo el mundo?

source: Where can you help translate this quiz?
es: ¿Dónde puedes ayudar a traducir este cuestionario?

source: At the openSUSE forum
es: En el foro de openSUSE

source: On GitHub issues
es: En la sección Issues de GitHub

source: In the IRC chat
es: En el chat de IRC

source: A quiz for friends of mainframes and exotic architectures.
es: Un cuestionario para amigos de mainframes y arquitecturas exóticas.

source: What’s the difference between Big Endian and Little Endian?
es: ¿Cuál es la diferencia entre Big Endian y Little Endian?

source: s390x are using only 31b, that’s why they’re called Little Endian
es: s390x usan solo 31b, por eso se llaman Little Endian

source: It’s about byte ordering; s390x being Big Endian
es: Se trata de la ordenación de bytes; s390x siendo Big Endian

source: It’s about byte ordering; s390x being Little Endian
es: Se trata de la ordenación de bytes; s390x siendo Little Endian

source: It’s not used anymore, s390x are Bi-endianess
es: Ya no se usa, s390x son Bi-endians

source: DASD is?
es: ¿Qué es DASD?

source: A German word
es: Una palabra alemana

source: Direct-access storage device
es: Dispositivo de almacenamiento de acceso directo

source: Swear word repeated often by s390x administrators
es: Palabrotas repetidas a menudo por los administradores de s390x

source: A scsi disk
es: Un disco scsi

source: HMC is?
es: ¿Qué es HMC?

source: Home mc, just a new friendlier Midnight Commander
es: Home mc, solo un nuevo y amigable Midnight Commander

source: The administration of mainframe machine through web interface from the 90’s
es: La administración de la máquina central a través de la interfaz web de los años 90

source: A command for listing hardware network addresses.
es: Un comando para enumerar direcciones de red de hardware.

source: A hidden module control unit
es: Una unidad de control de módulo oculto

source: z/VM is?
es: ¿Qué es z/VM?

source: Virtual Machine on Z (meaning s390x)
es: Máquina virtual en Z (es decir, s390x)

source: z/VM is operating system with the best backward compatibility
es: z/VM es el sistema operativo con la mejor compatibilidad con versiones anteriores

source: Remote desktop viewer
es: Visor de escritorio remoto

source: What does storage mean in the mainframe world?
es: ¿Qué significa almacenamiento en el mundo de los mainframes?

source: Memory (RAM)
es: Memoria (RAM)

source: Data storage (disks) counted in cylinders
es: Almacenamiento de datos (discos) contados en cilindros

source: A room where the mainframe is located
es: Una habitación donde se encuentra el mainframe

source: Compartment within a mainframe where the disks are located
es: Compartimiento dentro de un mainframe donde se encuentran los discos

source: What is x3270?
es: ¿Qué es x3270?

source: Special file encoding, which is a must for files on s390x
es: Codificación de archivos especial, que es imprescindible para los archivos en s390x

source: Terminal using unsecured telnet for connection to a machine
es: Terminal que utiliza telnet no seguro para la conexión a una máquina

source: Hexa code used as default admin password
es: Código hexadecimal utilizado como contraseña de administrador predeterminada

source: None of these ridiculous choices
es: Ninguna de estas ridículas opciones

source: What does IPL 150 mean?
es: ¿Qué significa IPL 150?

source: Give me additional 150MB of memory
es: Dame 150 MB de memoria adicionales

source: IP to my Linux machine
es: IP a mi máquina Linux

source: Boot from disk 150.
es: Arranque desde el disco 150.

source: Install Python Libraries version 1.5.0
es: Instalar la versión 1.5.0 de las bibliotecas de Python

source: What is IFL?
es: ¿Qué es IFL?

source: A variant of lung disease
es: Una variante de la enfermedad pulmonar

source: A core to run Linux on mainframe
es: Un núcleo para ejecutar Linux en mainframe

source: Made up word to confuse laptop users
es: Palabra inventada para confundir a los usuarios de portátiles

source: What is cio_ignore?
es: ¿Qué es cio_ignore?

source: A command masking visibility of devices
es: Un comando que enmascara la visibilidad de los dispositivos

source: Ignore input/output data until the line is ready to receive
es: Ignorar los datos de entrada/salida hasta que la línea esté lista para recibir

source: It actually means ignore CIO
es: En realidad, significa ignorar al CIO

source: A z/VM syslog filter
es: Un filtro de syslog de z/VM

source: How is the operating system on s390x administered?
es: ¿Cómo se administra el sistema operativo en s390x?

source: Linux (installed on bare metal)
es: Linux (instalado en hardware dedicado)

source: AI must be mentioned :) In which language(s) can’t you work with data models on s390x using hardware exploitation?
es: Hay que mencionar la IA :) ¿En qué lenguaje(s) no se puede trabajar con modelos de datos en s390x utilizando la explotación de hardware?

source: Which of the following I/O devices is typically not used with mainframes?
es: ¿Cuál de los siguientes dispositivos de E/S no se utiliza normalmente con los mainframes?

source: Disks
es: Discos

source: Tape drives
es: Unidades de cinta

source: Network
es: Red

source: Chameleon Fun for kids!
es: ¡Diversión camaleónica para niños!

source: A colorful quiz about chameleons and openSUSE for curious kids!
es: ¡Un colorido cuestionario sobre camaleones y openSUSE para niños curiosos!

source: What color can a chameleon turn into?
es: ¿De qué color puede convertirse un camaleón?

source: Only green
es: Solo verde

source: Any color, even purple!
es: ¡Cualquier color, incluso morado!

source: Many colors like green, brown, yellow
es: Muchos colores como verde, marrón, amarillo

source: Only black and white
es: Solo blanco y negro

source: What is the mascot of openSUSE?
es: ¿Cuál es la mascota de openSUSE?

source: A penguin
es: Un pingüino

source: A chameleon called Geeko
es: Un camaleón llamado Geeko

source: A dragon
es: Un dragón

source: A robot
es: Un robot

source: Why do chameleons change color?
es: ¿Por qué los camaleones cambian de color?

source: To show how they feel or to hide
es: Para mostrar cómo se sienten o para esconderse

source: Because they are bored
es: Porque están aburridos

source: Because they are cold-blooded robots
es: Porque son robots de sangre fría

source: To glow in the dark
es: Para brillar en la oscuridad

source: How do chameleons catch their food?
es: ¿Cómo atrapan su comida los camaleones?

source: With their hands
es: Con sus manos

source: With their long sticky tongue
es: Con su lengua larga y pegajosa

source: By shouting at it
es: Gritándola

source: With a net
es: Con una red

source: What do chameleons eat?
es: ¿Qué comen los camaleones?

source: Ice cream
es: Helado

source: Insects
es: Insectos

source: Pineapples
es: Piñas

source: Hot dogs
es: Perritos calientes

source: What makes openSUSE special?
es: ¿Qué hace especial a openSUSE?

source: It can talk to animals
es: Puede hablar con los animales

source: It’s a free modern, and secure operating system anyone can use
es: Es un sistema operativo libre, moderno y seguro que cualquiera puede usar

source: It’s made of chameleon scales
es: Está hecho de escamas camaleónicas

source: It’s only for secret agents
es: Es solo para agentes secretos

source: Do all chameleons look the same?
es: ¿Todos los camaleones tienen el mismo aspecto?

source: Yes, they are all green and grumpy
es: Sí, todos son verdes y gruñones

source: No, they come in many shapes, sizes, and colors
es: No, poseen muchas formas, tamaños y colores

source: Yes, they all wear hats
es: Sí, todos usan sombreros

source: They all wear openSUSE stickers
es: Todos llevan pegatinas de openSUSE

source: What does the word 'open' in openSUSE mean?
es: ¿Qué significa la palabra 'open' en openSUSE?

source: It’s a password
es: Es una contraseña

source: It means everyone can use it and help make it better
es: Significa que todos pueden usarlo y ayudar a mejorarlo

source: It’s only for opening doors
es: Es solo para abrir puertas

source: It’s about opening candy wrappers
es: Se trata de abrir envoltorios de caramelos

source: Can chameleons move their eyes separately?
es: ¿Pueden los camaleones mover los ojos por separado?

source: No, they blink both eyes together
es: No, parpadean con los dos ojos a la vez

source: Yes, they can look in two directions at once!
es: ¡Sí, pueden mirar en dos direcciones a la vez!

source: They close one eye when sleeping
es: Cierran un ojo cuando duermen

source: No, their eyes are always closed
es: No, sus ojos siempre están cerrados

source: No users found
es: No se ha encontrado ningún usuario

source: Please enter a username to submit.
es: Ingrese un nombre de usuario para enviar.

source: Username must be at least 3 characters long.
es: El nombre de usuario debe tener al menos 3 caracteres.

source: Leaderboard
es: Tabla de clasificación

source: Auto Refresh
es: Actualización automática

source: lang_name_he
es: Hebreo

source: lang_name_sk
es: Eslovaco

source: lang_name_nl
es: Holandés

source: Don't worry this quiz is mostly educational. No need to know all the answers.
tr: Endişelenmeyin bu sınav çoğunlukla eğitici. Tüm cevapları bilmenize gerek yok.

source: At the University of Helsinky
tr: Helsinky Üniversitesi
